<!-- add-pr-comment:add-pr-comment -->

#### Terraform Plan 📖success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=2851a7b3aac1cb95d3336c40a60918b5b6ed706e]
module.daily_snapshot.data.external.sources_zip: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.external.sources_zip: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=8f898431cc98adbb3d68698230d34c72361b333f]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=346779045]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=30a0acac-15d1-47ef-bb85-65fdc8130d31]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 5s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-03-22T15:41:14Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "346779045" -> (known after apply)
      ~ ipv4_address         = "165.22.72.161" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.10" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-snapshot-calibnet"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:346779045" -> (known after apply)
      ~ user_data            = "366bfbadb5d34a83ef978496dd1fda211d021997" -> "973555a53088d1b1542f27af066733b7f705c448" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 346779045,
        ] -> (known after apply)
        id              = "30a0acac-15d1-47ef-bb85-65fdc8130d31"
        name            = "forest-snapshot-calibnet"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:346779045",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "165.22.72.161",
        ],
      + [
          + null,
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>